jimmywong2003/nrf52-change-device-name-for-production/ble_app_uart/main.c
static uint16_t m_conn_handle          = BLE_CONN_HANDLE_INVALID;                   /**< Handle of the current connection. */
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;              /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
        {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

static bool m_advertising_is_ongoing = false;
static ble_gap_addr_t device_addr;
static bool m_uart_is_ongoing = false;
static uint8_t device_name[20];

typedef struct uart_buffer_type_s {
        uint8_t data_array[256];
        uint16_t length;
} uart_buffer_type_t;

static uart_buffer_type_t m_uart_packet;


static void advertising_stop(void);
static void advertising_start(void);

typedef enum
{
        BLE_FLASH_EVT_DEV_NAME = 0,
        BLE_FLASH_EVT_MAC_ADDRESS,
} ble_device_flash_evt_type_t;


/**@brief Thingy default configuration. */
#define DEVICE_CONFIG_DEFAULT                         \
        {                                             \
                .dev_name =                           \
                {                                     \
                        .name = DEVICE_NAME,          \
                        .len = 10                     \
                },                                    \
                .device_addr =                        \
                {                                     \
                        .addr_id_peer = 0,           \
                        .addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC, \
                        .addr = {0xCC, 0xAA, 0xAA, 0xAA, 0xAA, 0xCC}, \
                },                                    \
        }
static device_config_t         * m_device_config;
static const device_config_t m_device_default_config = DEVICE_CONFIG_DEFAULT;


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
        app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(bool load_setting)
{
        uint32_t err_code;
        ble_gap_conn_params_t gap_conn_params;
        ble_gap_conn_sec_mode_t sec_mode;

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

        if (load_setting)
        {
                if (m_device_config)
                {
                        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                                              m_device_config->dev_name.name,
                                                              strlen((const char *)m_device_config->dev_name.name));
                        APP_ERROR_CHECK(err_code);
                        NRF_LOG_INFO("gap_params device name = %s", m_device_config->dev_name.name);
                }
        }
        else
        {
                err_code = sd_ble_gap_device_name_set(&sec_mode,
                                                      (const uint8_t *) DEVICE_NAME,
                                                      strlen(DEVICE_NAME));
                APP_ERROR_CHECK(err_code);
        }
        if (load_setting)
        {
                if (m_device_config)
                {
                        m_device_config->device_addr.addr_type     = BLE_GAP_ADDR_TYPE_PUBLIC;
                        err_code = sd_ble_gap_addr_set(&m_device_config->device_addr);
                        APP_ERROR_CHECK(err_code);

                        NRF_LOG_INFO("gap_params set address");
                        NRF_LOG_HEXDUMP_INFO(&m_device_config->device_addr.addr, 6);
                }
        }
        // err_code = sd_ble_gap_device_name_set(&sec_mode,
        //                                       (uint8_t *) device_name,
        //                                       strlen(device_name));
        //
        // NRF_LOG_INFO("device name error %d", err_code);
        // APP_ERROR_CHECK(err_code);

        memset(&gap_conn_params, 0, sizeof(gap_conn_params));

        gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
        gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
        gap_conn_params.slave_latency     = SLAVE_LATENCY;
        gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

        err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
        APP_ERROR_CHECK(err_code);
}

//
///* Function returns true if string contains wildcard character: '?' or '*'. */
//static bool wildcard_character_exist(char * p_str)
//{
//    size_t str_len = cli_strlen(p_str);
//    for (size_t i = 0; i < str_len; i++)
//    {
//        if ((p_str[i] == '?') || (p_str[i] == '*'))
//        {
//            return true;
//        }
//    }
//    return false;
//}


static void SetMacAddress(ble_gap_addr_t *device_addr)
{
        uint32_t err_code;
        device_addr->addr_type     = BLE_GAP_ADDR_TYPE_PUBLIC;
        err_code = sd_ble_gap_addr_set(device_addr);
        APP_ERROR_CHECK(err_code);

        // err_code = app_sched_event_put(NULL, 0, advertising_start);
        // APP_ERROR_CHECK(err_code);
}

static void GetMacAddress(ble_gap_addr_t *device_addr)
{
        uint32_t err_code;
        err_code = sd_ble_gap_addr_get(device_addr);
        APP_ERROR_CHECK(err_code);
}

static void ChangeMacAddress(void)
{
        advertising_stop();
        GetMacAddress(&device_addr);
        device_addr.addr[0]       = 0xAA;
        device_addr.addr[1]       = 0xBB;
        device_addr.addr[2]       = 0xCC;
        device_addr.addr[3]       = 0xDD;
        device_addr.addr[4]       +=    1;
        SetMacAddress(&device_addr);
}

static void ChangeDeviceName(void)
{
        uint32_t err_code;
        ble_gap_conn_sec_mode_t sec_mode;
        ble_gap_conn_params_t gap_conn_params;
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
        static uint8_t index = 0;

        advertising_stop();

        sprintf(device_name, "HUAWEI_DEVICE %d", index);
        index++;
        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                              (uint8_t *) device_name,
                                              strlen(device_name));

        NRF_LOG_INFO("device name error %d", err_code);
        APP_ERROR_CHECK(err_code);

        // advertising_init();
        //
        // err_code = app_sched_event_put(NULL, 0, advertising_start);
        // APP_ERROR_CHECK(err_code);

