jimmywong2003/nrf52-change-device-name-for-production/ble_app_uart/main.c
}


static void ble_on_sys_evt(uint32_t sys_evt, void *p_context)
{
        switch(sys_evt)
        {
        case NRF_EVT_FLASH_OPERATION_ERROR:
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
                //if (s_waiting_for_flash)
        {
                if (!nrf_fstorage_is_busy(NULL))
                {
                        uint32_t err_code;
                        NRF_LOG_INFO("Flash Operation Success and Device will be RESET soon.");

                        if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
                        {
                                // Disconnect on GATT Server timeout event.
                                err_code = sd_ble_gap_disconnect(m_conn_handle,
                                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                                APP_ERROR_CHECK(err_code);
                        }

                        nrf_delay_ms(1000);
                        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_RESET);

                }
        }
        break;
        default:
                /* Ignore */
                break;
        }
}

NRF_SDH_SOC_OBSERVER(ble_soc_observer, APP_SOC_OBSERVER_PRIO, ble_on_sys_evt, NULL);

/**@brief Checks the current version of the FW against the previous version stored in flash.
 * If a major or minor FW change is detected, modules must reinitialize their flash storage.
 *
 * @note: If the FW version is changed while erasing all flash, a FW change cannot be detected.
 */
// static uint32_t device_config_verify(void)
// {
//         bool update_flash = false;
//         uint32_t err_code;
//
//         bool fw_version_major_changed = ( m_device_config->device_addr.addr_type != m_ble_default_config.fw_version.major );
//         bool fw_version_minor_changed = ( m_device_config->device_addr.addr_type != m_ble_default_config.fw_version.minor );
//         bool fw_version_patch_changed = ( m_device_config->device_addr.patch != m_ble_default_config.fw_version.patch );
//
//         ble_tcs_fw_version_t prev_fw_version = m_device_config->fw_version;
//
//         if ( fw_version_major_changed || fw_version_minor_changed || fw_version_patch_changed)
//         {
//                 m_device_config->fw_version.major = m_ble_default_config.fw_version.major;
//                 m_device_config->fw_version.minor = m_ble_default_config.fw_version.minor;
//                 m_device_config->fw_version.patch = m_ble_default_config.fw_version.patch;
//
//                 update_flash = true;
//
//                 if(fw_version_major_changed || fw_version_minor_changed)
//                 {
//                         update_flash = false;
//                         m_major_minor_fw_ver_changed = true;
//
//                         err_code = m_ble_flash_config_store(&m_ble_default_config);
//                         APP_ERROR_CHECK(err_code);
//                 }
//         }
//
//         NRF_LOG_INFO("m_ble: Current FW: v%d.%d.%d \r\n",
//                      m_ble_default_config.fw_version.major, m_ble_default_config.fw_version.minor, m_ble_default_config.fw_version.patch);
//
//         if(m_major_minor_fw_ver_changed)
//         {
//                 NRF_LOG_INFO("m_ble: Major or minor FW version changed. Prev. FW (from flash): v%d.%d.%d \r\n",
//                              prev_fw_version.major, prev_fw_version.minor, prev_fw_version.patch);
//         }
//
//         // Check Eddystone URL length.
//         if (m_device_config->dev_name.len > 0)
//         {
//                 memcpy(m_device_config->eddystone_url.data, m_ble_default_config.eddystone_url.data, m_ble_default_config.eddystone_url.len);
//                 m_device_config->eddystone_url.len = m_ble_default_config.eddystone_url.len;
//                 update_flash = true;
//         }
//
//         return NRF_SUCCESS;
// }


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

        if (p_evt->type == BLE_NUS_EVT_RX_DATA)
        {
                uint32_t err_code;

                NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
                NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

                for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
                {
                        do
                        {
                                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                                {
                                        NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                                        APP_ERROR_CHECK(err_code);
                                }
                        } while (err_code == NRF_ERROR_BUSY);
                }
                if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
                {
                        while (app_uart_put('\n') == NRF_ERROR_BUSY);
                }
        }

}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
        uint32_t err_code;
        ble_nus_init_t nus_init;
        nrf_ble_qwr_init_t qwr_init = {0};

