jimmywong2003/nrf52-change-device-name-for-production/ble_app_uart/main.c
/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
        ret_code_t err_code;

        err_code = nrf_sdh_enable_request();
        APP_ERROR_CHECK(err_code);

        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ram_start = 0;
        err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
        APP_ERROR_CHECK(err_code);

        // Enable BLE stack.
        err_code = nrf_sdh_ble_enable(&ram_start);
        APP_ERROR_CHECK(err_code);

        // Register a handler for BLE events.
        NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);


        err_code = sd_power_mode_set(NRF_POWER_MODE_LOWPWR);
        APP_ERROR_CHECK(err_code);

        err_code = sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
        if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
        {
                m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
                NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
        }
        NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                      p_gatt->att_mtu_desired_central,
                      p_gatt->att_mtu_desired_periph);
}


/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
        ret_code_t err_code;

        err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        APP_ERROR_CHECK(err_code);
}

static void advertising_stop(void)
{
        ret_code_t err_code;
        if (m_advertising_is_ongoing == true)
        {
                err_code = sd_ble_gap_adv_stop(m_advertising.adv_handle);
                APP_ERROR_CHECK(err_code);

                m_advertising_is_ongoing = false;
                NRF_LOG_INFO("Advertising Stop");
        }
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
        if (m_advertising_is_ongoing == false)
        {
                uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
                APP_ERROR_CHECK(err_code);

                m_advertising_is_ongoing = true;
                NRF_LOG_INFO("Advertising Start");
        }
}


/**@brief Function for handling thingy configuration events.
 */
static void device_flash_update_evt_handler (ble_device_flash_evt_type_t evt_type,
                                             uint8_t          * p_data,
                                             uint16_t length)
{
        bool update_flash = false;
        {
                switch (evt_type)
                {
                case BLE_FLASH_EVT_DEV_NAME:
                        if (length <= DEVICE_NAME_LEN_MAX)
                        {
                                memcpy(m_device_config->dev_name.name, p_data, length);
                                m_device_config->dev_name.name[length] = 0;
                                m_device_config->dev_name.len = length;
                                update_flash = true;
                                NRF_LOG_INFO("Change the Name: %s", m_device_config->dev_name.name);
                        }
                        break;
                case BLE_FLASH_EVT_MAC_ADDRESS:
                        if (length == BLE_GAP_ADDR_LEN)
                        {
                                NRF_LOG_INFO("Update the MAC address!");
                                NRF_LOG_HEXDUMP_INFO(p_data, length);
                                memcpy(&m_device_config->device_addr.addr, p_data, length);
                                update_flash = true;
                        }
                        break;
                }
        }

        if (update_flash)
        {
                uint32_t err_code;

                err_code = m_ble_flash_config_store(m_device_config, false);
                APP_ERROR_CHECK(err_code);
        }
}

void app_uart_receive_command_handler(void * p_event_data, uint16_t size)
{
        uint32_t err_code;

        if (m_uart_packet.length <= 2)
                return;

        uint8_t length = m_uart_packet.length-2; // remove the new line

        NRF_LOG_HEXDUMP_DEBUG(m_uart_packet.data_array,m_uart_packet.length);

        if (strncmp("start", m_uart_packet.data_array, length) == 0)
        {
                advertising_start();
        }
        else if (strncmp("stop", m_uart_packet.data_array, length) == 0)
        {
                advertising_stop();
        }
        else if (strncmp("name", m_uart_packet.data_array, length) == 0)
        {
                NRF_LOG_INFO("Change device name");
                ChangeDeviceName();
                uint8_t device_name[] = "JIMMY";
                device_flash_update_evt_handler(BLE_FLASH_EVT_DEV_NAME, device_name, sizeof(device_name));
        }
        else if (strncmp("mac1", m_uart_packet.data_array, length) == 0)
        {
                NRF_LOG_INFO("change MAC address");
                ChangeMacAddress();
                ble_gap_addr_t device_address;
                device_address.addr_id_peer = 0;
                device_address.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
                device_address.addr[0] = 0xEE;
                device_address.addr[1] = 0xEE;
                device_address.addr[2] = 0xEE;
                device_address.addr[3] = 0xEE;
                device_address.addr[4] = 0xEE;
                device_address.addr[5] = 0xEE;
                device_flash_update_evt_handler(BLE_FLASH_EVT_MAC_ADDRESS, device_address.addr, BLE_GAP_ADDR_LEN);
        }
        else if (strncmp("mac2", m_uart_packet.data_array, length) == 0)
        {
                NRF_LOG_INFO("change MAC address");
                ChangeMacAddress();
                ble_gap_addr_t device_address;
                device_address.addr_id_peer = 0;
                device_address.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
                device_address.addr[0] = 0xDD;
                device_address.addr[1] = 0xDD;
                device_address.addr[2] = 0xDD;
                device_address.addr[3] = 0xDD;
                device_address.addr[4] = 0xDD;
                device_address.addr[5] = 0xDD;
                device_flash_update_evt_handler(BLE_FLASH_EVT_MAC_ADDRESS, device_address.addr, BLE_GAP_ADDR_LEN);
        }
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
        uint32_t err_code;
        switch (event)
        {
        // case BSP_EVENT_SLEEP:
        //         sleep_mode_enter();
        //         break;

        case BSP_EVENT_DISCONNECT:
                err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                        APP_ERROR_CHECK(err_code);
                }
                break;

        case BSP_EVENT_WHITELIST_OFF:
                if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
                {
                        err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                        if (err_code != NRF_ERROR_INVALID_STATE)
                        {
                                APP_ERROR_CHECK(err_code);
                        }
                }
                break;

        default:
                break;
        }
}





